## Staging: load-balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_lb_listener.wordpress will be updated in-place
  ~ resource "aws_lb_listener" "wordpress" {
        id                = "arn:aws:elasticloadbalancing:ca-central-1:729164266357:listener/app/wordpress/3c7f3e17b6363a06/c956721664f56e5d"
        tags              = {}
        # (7 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:729164266357:targetgroup/wp20210927173854285300000001/072b784088cb0c0a" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.wordpress must be replaced
+/- resource "aws_lb_target_group" "wordpress" {
      ~ arn                                = "arn:aws:elasticloadbalancing:ca-central-1:729164266357:targetgroup/wp20210927173854285300000001/072b784088cb0c0a" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/wp20210927173854285300000001/072b784088cb0c0a" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:ca-central-1:729164266357:targetgroup/wp20210927173854285300000001/072b784088cb0c0a" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ name                               = "wp20210927173854285300000001" -> (known after apply)
      ~ port                               = 443 -> 8443 # forces replacement
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress"
        }
        # (10 unchanged attributes hidden)

      ~ health_check {
          ~ port                = "443" -> "8443"
            # (8 unchanged attributes hidden)
        }

      ~ stickiness {
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ alb_target_group_arn        = "arn:aws:elasticloadbalancing:ca-central-1:729164266357:targetgroup/wp20210927173854285300000001/072b784088cb0c0a" -> (known after apply)
  ~ alb_target_group_arn_suffix = "targetgroup/wp20210927173854285300000001/072b784088cb0c0a" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>